Repository: Gagaved/web-app-folio
Catalog: lib/l10n/app_*.arb
Languages: ru

# topBarHome
source: Home
ru: Главная

# topBarResume
source: Resume
ru: Резюме

# topBarGames
source: Games
ru: Игры

# topBarBlog
source: Blog
ru: Блог

# homeWelcome
source: Welcome to my website! Here, I showcase all my applications. Get acquainted with my creations below.
ru: Добро пожаловать на мой веб-сайт! Здесь я публикую все мои приложения.

# inMindDescription
source: InMind! is an app for practicing mental calculations, designed to enhance mathematical thinking skills. It offers tasks of varying difficulty, timed practice options, and error analysis for more effective learning.
ru: InMind! - это приложение для тренировки устного счета, разработанное для развития навыков математического мышления. Оно предлагает задания разной сложности, опции тренировки по времени и анализ ошибок для более эффективного обучения.

source: my Apps
ru: Мои приложения

source: private policy
ru: Политика конфиденциальности

source: and
ru: и

source: use of terms
ru: Условия испрользования

# titleName
source: Morozov Ignat
ru: Игнат Морозов

# titleCopiedToClipboard
source: copied to clipboard
ru: скопирован в буфер обмена

# languageAndFrameworksTitle
source: Languages and Frameworks
ru: Языки и фреймворки

# languageAndFrameworksLanguages
source: I know, can, and want to write in the following languages: Dart, Kotlin, Python. C++
ru: Знаю, могу и хочу писать на следующих языках: Dart, Kotlin, Python. C++

# languageAndFrameworksFrameworks
source: What I've worked with: Flutter, Android NDK, Git, Firebase, FastApi, Cuda
ru: С чем я работал: Flutter, Android NDK, Git, Firebase auth, FastApi, Cuda

# languageAndFrameworksLessConfident
source: Less confidently, but I know the basics of these languages: Js, C#
ru: Менее уверенно, но знаю основы этих языков: Js, C#

# projectsTitle
source: Projects
ru: Проекты

# experienceTitle
source: Experience
ru: Опыт

# educationTitle
source: Education
ru: Образование

# projectLink
source: Link
ru: Ссылка

# projectTitle1
source: InMind! App for mental Counting Practice
ru: InMind! приложение для тренировки устного счета

# projectTitle2
source: Development of Personal Website
ru: Разработка собственного сайта

# projectTitle3
source: App for FEFU Engineering School
ru: Приложение для инженерной школы FEFU

# projectTitle4
source: MVP Office Space Booking App. ATB and FEFU Plug-in.
ru: MVP приложение для бронирования мест в офисе. Plug-in ATB и FEFU.

# projectTitle5
source: App for Sewing Factory using Android NDK
ru: Приложение для швейной фабрики на Android NDK

# projectTitle6
source: Fitness Tracker using Android NDK
ru: Фитнес трекер на Android NDK

# projectDescription1
source: Developing an mental counting practice app on the Flutter Android platform with a Python+FastAPI backend. The app is published on the Play Market.
ru: Разрабатываю приложение для тренировки устного счета на платформе Flutter android и бэкенд для него на python+fastApi. Приложение опубликовано в Google Play

# projectDescription2
source: I'm developing a Flutter web application for my personal website: www.ignatmorozov.ru
ru: Веду разработку Flutter web приложения для своего сайта. www.ignatmorozov.ru

# projectDescription3
source: Developed a Flutter Windows application, a simulator for FEFU's engineering school, simulating the operation of a gas distribution station with hydraulic circuit calculations.
ru: Разработал Flutter windows приложение тренажер-симулятор для инженерной школы FEFU, имитирующий работу газораспределительной станции, с возможностью проводить гидравлический расчет по схеме

# projectDescription4
source: A team of 4 developed a client-server MVP office space booking app for a bank.
ru: Разработали командой из 4 человек клиент-серверное MVP-приложение для бронирования рабочих мест в офисе банка.

# projectDescription5
source: Participated in the team development of an Android NDK app for a sewing factory. This project was part of a coursework.
ru: Участвовал в командной разработке приложения для швейной фабрики на Android NDK, в рамках курсового проекта.

# projectDescription6
source: Developed a fitness tracker on the Android NDK platform.
ru: Разработал фитнес трекер на платформе Android NDK.

# experienceDartFlutter
source: I've been using Dart + Flutter for about a year and a half.
ru: На Dart + Flutter пишу около полутора лет.

# experienceRenderingMechanism
source: I understand how Flutter's rendering mechanism works, including Diffing Algorithm Widget tree, Element tree, Render tree.
ru: Понимаю, как работает механизм рендеринга Flutter, Diffing Algorithm Widget tree, Element tree, Render tree.

# experienceKeys
source: I know the purpose of global key, value key, unique key.
ru: Знаю зачем нужны global key, value key, unique key.

# experienceAsync
source: I understand Dart's concurrency mechanisms: Isolate, Future, async/await.
ru: Понимаю как работает "многопоточность" Dart, Isolate, Future, async/await.

# experienceOop
source: I'm comfortable with the language and framework. Familiar with REST, SOLID principles, MVVM MVC architectural patterns, and have object-oriented programming skills.
ru: Хорошо ориентируюсь в языке и фреймворке. Знаком с принципами REST, SOLID, KISS, DRY, с архитектурными паттернами MVVM MVC, обладаю навыками объектно-ориентированного программирования, понимаю концепции классов, объектов, наследования, инкапсуляции и полиморфизма.

# experienceAlgorithms
source: I know algorithms and data structures: sorting, searching, lists, stacks, queues, etc.
ru: Отлично знаю алгоритмы и структуры данных: сортировки, поиски, хэш-таблицы, деревья, стеки, очереди и т.д.

# experienceCleanArchitecture
source: I understand clean architecture principles: layer separation, dependencies, and inversion of control.
ru: Понимаю принципы чистой архитектуры: разделение на слои, зависимости и инверсию управления.

# workWithTitle
source: Experience with
ru: С чем работал

# workWithItemStateManagement
source: State management
ru: Стейтменеджмент

# workWithItemStateManagementSubItem2
source: Some experience with Riverpod (this website)
ru: так же знаком с Riverpod (этот сайт)

# workWithItemDatabases
source: Databases
ru: Базы данных

# workWithItemDatabasesSubItem1
source: Worked with Drift
ru: Работал с Drift

# workWithItemDatabasesSubItem2
source: Some experience with Floor
ru: Небольшой опыт работы с Floor

# workWithItemAuthentication
source: Authentication
ru: Аутентификация

# workWithItemAuthenticationSubItem
source: Integrated Firebase OAuth and Google Sign-In into own app
ru: Интегрировал Firebase OAuth и Google Sign-In в собственное приложение

# workWithItemLocalization
source: Localization
ru: Локализация

# workWithItemLocalizationSubItem
source: Used intl in personal projects
ru: локализовывал с помощью intl в собственных проектах

# workWithItemDi
source: Dependency Injection
ru: DI (Dependency Injection)

# workWithItemDiSubItem
source: Used getIt in personal projects
ru: Использовал getIt в собственных проектах

# workWithItemRestSubItem
source: Worked with Dio library for HTTP requests
ru: Работал с библиотекой Dio для HTTP-запросов

# educationInfo
source: Studying at FEFU as a fourth-year student in Applied Mathematics and Informatics.
ru: Учусь в ДВФУ на 4 курсе на специальности «Прикладная математика и информатика»

# softSkillsCommunicative
source: I'm very open and communicative, easily finding common ground with anyone.
ru: Я очень открытый и коммуникативный человек, легко могу найти общий язык с любым человеком.

# softSkillsPatient
source: I'm patient; I don't mind explaining a topic multiple times until it's understood =)
ru: Достаточно терпелив, для меня нет никакой трудности несколько раз объяснять человеку какую-нибудь тему, пока он не поймет =)

# softSkillsSelfOrganized
source: Capable of self-organization and organizing others.
ru: Способен самоорганизовываться и организовывать других.
